home/programs/emacs/emacs.org
#+title: Emacs Configuration
#+author: icurry
#+language: en
#+options: toc:2 num:t author:t

Obligatory Frieren Ascii art.

#+begin_example text
            Frieren
⠀⠀⠀⠀⠀⠀⢀⡴⢾⣶⣴⠚⣫⠏⠉⠉⠛⠛⢭⡓⢶⣶⠶⣦⡀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣰⠋⡀⣠⠟⢁⣾⠇⠀⣀⣷⠀⠀⠓⣝⠂⠙⣆⢄⢻⡞⢢⠀⠀⠀
⠀⠀⠀⠀⢠⡇⢸⢡⠃⢠⡞⠁⠀⣰⡟⠉⢦⣄⠀⠈⢆⠀⢻⣾⡄⢧⢸⠀⠀⠀
⠀⠀⠀⠀⢸⠀⡇⡌⠀⡞⠀⢀⣴⡋⠀⠀⠀⣙⣷⡀⠘⡄⠘⣿⣧⢸⣼⣥⠀⠀
⣀⣀⣀⣀⣞⣰⠁⡇⠀⣧⠴⠛⠛⠁⠀⠀⠀⠉⠉⠙⠦⡇⠀⣿⣸⣼⣿⣇⣀⣀
⠳⢽⣷⠺⡟⡿⣯⡇⠰⣧⠠⣿⡷⠂⠀⠀⠀⠐⣾⠷⠀⡀⠀⣿⡟⣴⠶⢁⡨⠊
⠀⠀⠉⢳⢦⣅⠘⣿⣄⢿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡇⢀⣏⣳⣿⣴⡞⠈⠀
⠀⠀⠀⣼⢸⡅⢹⣿⣿⣾⣟⠀⠀⢠⣀⣄⣠⠀⠀⢠⣾⣿⡿⣿⢻⠁⢹⣷⡀⠀
⠀⠀⠸⡏⠸⡇⢼⣿⡿⠟⠛⠓⣦⣄⣀⣀⣀⣀⡤⠴⠿⢿⡟⠛⠺⣦⣬⣗⠀⠀
⠀⠀⢰⡇⠀⡇⠸⡏⠀⠀⢰⠋⠙⠛⠛⠉⠉⢹⠀⠀⠀⠀⡇⠀⠀⣿⣿⣿⣿⡇
⠀⡐⣾⠀⡀⢹⠀⣿⣄⠀⢸⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⢠⣇⠀⠀⣿⣿⣿⣿⣿
⣰⣿⣿⠀⡇⠘⡄⢸⣿⠆⠈⡇⠀⠀⠀⠀⠈⢉⠃⠀⣰⡾⠻⠃⢰⣿⣿⣿⣿⡇
⣿⣿⣿⡆⢷⠀⢧⠈⣿⠤⠤⣇⠀⠀⠀⠀⢀⣸⣠⢾⠟⠓⡶⢤⣾⣿⣿⣿⣿⣷
#+end_example

This is my configuration for GNU Emacs. It is a [[https://protesilaos.com/codelog/2025-01-26-emacs-organise-init/][literate configuration]], meaning that the documentation (prose) and configuration (code) are part of one file, right next to each other. This makes it easier for future me and others to be able to know what each part of my configuration does. That said, it is still possible for the prose and the code to become out of sync so please be aware of that when reading (i.e. if there is a discrepancy between the code and the prose, go with the code). I have primarily based my configuration specifically, and my approach to Emacs generally, off of [[https://protesilaos.com/emacs/dotemacs][Proesilaos Stavrou's]]. I highly recommend reading through some of his configuration as it is one of the most well documented and well structured configurations for Emacs out there.

The way my configuration works is that the code parts of this file get copied out (tangled) to their respective files, meaning that Emacs does not read from this file at all. The main benefit of doing this is speed, Emacs only has to worry about the code parts, not finding the code among the prose (its more complicated than this but thats the gist). My configuration is structured as follows:
- =init.el= :: This is the file Emacs reads from after starting. Here I take care of the some the fundamental stuff like setting up package management, checking if the feature configuration macro (~use-package~) is installed, and loading my configuration modules.
- =cur-config= :: This is the directory I keep all my configuration modules in. Each "module" is really just an Emacs Lisp file that configures a part of Emacs. Although these are Emacs Lisp files and I /could/ write anything in here (it is a complete programming language), I try to keep extending the functionalities of Emacs out of these files. These files tend to only set variables (settings in Emacs) and change key bindings.
- =cur-lisp= :: This directory contains modules that extend the functionality of Emacs or Emacs packages. A good example is my custom [[info:emacs#Mode Line][mode line]], which I find cleaner that the default.
- =themes= :: This is the directory where I store themes to change the color scheme of Emacs. It needs a major overhaul and can effectively ignored.

* Initialization of Emacs (=init.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./init.el
:ID:       38c3c91c-fcd9-48e1-8fe8-bef0085a12fc
:END:

This is the beginning of my configuration. All code in here gets tangled out into =init.el= and is loaded by Emacs on startup.

** =init.el= section on Emacs version check
:PROPERTIES:
:ID:       16193924-963c-4e0c-b2c8-34b65c7ce743
:END:

This is to check what version of Emacs is being used. I do not test this configuration on any Emacs version less than 29.4. Using this configuration on any version less than 29.4 could lead to [[https://youtube.com/watch?v=xtrqYdvZ29E][unforeseen consequences]].

#+begin_src emacs-lisp
;; ===Check Emacs Version===
(when (version< emacs-version "29.4")
  (error "This setup is only guarunteed to work on 29.4, disable this line to load anyways."))
#+end_src

** =init.el= section on some basic settings
:PROPERTIES:
:ID:       5ba13056-a274-4213-af86-dadd25293fb4
:END:

These are some basic settings that I want Emacs to load up front. Most of them are built in or core to the function of Emacs. If the rest of my configuration fails to load, I would like to at minimum have these settings enabled. There are comments next to each of them explaining what each of them does. The only exception is the one setting the scratch buffer.

#+begin_src emacs-lisp
;; ===Basic Settings===
(setq frame-title-format "%b")      ; Set window title to buffer name
(setq initial-scratch-message ";; Scratch Buffer\n\n")
(setq initial-buffer-choice t)      ; Scratch as initial buffer
(setq make-backup-files nil)        ; No more file~ everywhere
(setq inhibit-startup-message t)    ; Starts on blank screen
(setq scroll-conservatively 101)    ; Enable Line by line scrolling
(setq scroll-margin 0)              ; Start scrolling when at the very top/bottom of window
(setq recenter-positions '(top bottom middle)) ; recenter line on top, then bottom, then middle
(setq use-dialog-box nil)           ; No yes-no-p for mouse clicks
(setq use-short-answers t)          ; Use y-or-n-p for yes-no dialogue.
(setq async-shell-command-buffer 'new-buffer) ; Create new buffer or each async-shell-command
(scroll-bar-mode -1)                ; Disable visible scrollbar
(tool-bar-mode -1)                  ; Disable tool bar
(menu-bar-mode -1)                  ; Disable menu bar
(tooltip-mode -1)                   ; Disable tooltips
(set-fringe-mode 10)                ; No idea what this does
#+end_src

** =init.el= section on enabling disabled functions
:PROPERTIES:
:ID:       3b95a744-fb39-4582-8652-78c4bad57520
:END:

These functions are disabled by default, meaning Emacs will ask me to confirm if I really want to run them. This makes sense for beginners but I use these functions often enough that I want them enabled.

#+begin_src emacs-lisp
;; ===Enable Disabled Functions===
(dolist (c '(narrow-to-region narrow-to-page upcase-region downcase-region))
  (put c 'disabled nil))
#+end_src

** =init.el= section on "disabling" custom
:PROPERTIES:
:ID:       e3f462eb-1464-45e6-84e5-a17cfee2797b
:END:

Set ~custom-file~ to a temp file so I don't have to deal with custom. This is a tip I learned from [[https://protesilaos.com/emacs/dotemacs#h:f2ffe0e9-a58d-4bba-9831-cc35940ea83f][Protesilaos' config]]. If you are just starting with Emacs you may want to consider using =M-x customize= and friends in the interim. However, in the long run it will limit you and I recommend learning the basics of elisp as quickly as you can. If you have little to no prior experience to programming, consider reading [[https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html][An Introduction to Programming in Emacs Lisp]]. It is a book written for non-technical people and should provide a solid base for you to work on your configuration and extend Emacs' capabilities.

#+begin_src emacs-lisp
;; ===Disable Custom===
(setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

** =init.el= section on package.el and package archives
:PROPERTIES:
:ID:       e6684d48-0111-450f-9809-a587079ee9ec
:END:

This is only used if I find myself on a non-nixos system, as I have nixos manage my Emacs packages instead.

#+begin_src emacs-lisp
;; ===Package Initialization===
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("elpa" . "https://elpa.gnu.org/packages/")
                         ("nongnu" . "https://elpa.nongnu.org/nongnu/"))) ;; Setting Repos
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src

** =init.el= section on use-package
:PROPERTIES:
:ID:       095c9460-65d2-4884-ab8f-e3ea428863e7
:END:

Requiring ~use-package~ as that is what I use for almost all of my configuration. It is a macro that allows for easily declaring configuration for a specific [[info:elisp#Named Features][feature]] (think a program or plug-in within Emacs). Please read the [[info:use-package][info manual]] for how to use it and use [[https://jwiegley.github.io/use-package/keywords/][this keyword overview]] for a quick a reference if you need a refresher while using the macro.

#+begin_src emacs-lisp
;; ===use-package Initialization===
(require 'use-package)
#+end_src

** =init.el= section on configuration modules.
:PROPERTIES:
:ID:       5f5ac6fb-9a3e-4c61-b585-f5a19c10f9f9
:END:

First, I add the =cur-lisp= and =cur-config= to the ~load-path~. Then its just as simple as ~(require 'module)~.

#+begin_src emacs-lisp
;; ===Load Modules and Packages===
(dolist (path '("cur-lisp" "cur-config"))
  (add-to-list 'load-path (locate-user-emacs-file path)))

(require 'cur-config-essentials)
(require 'cur-config-bindings)
(require 'cur-config-dired)
(require 'cur-config-faces)
(require 'cur-config-completion)
(require 'cur-config-window)
(require 'cur-config-ide)
(require 'cur-config-shell)
(require 'cur-config-org)
(require 'cur-config-net)
(require 'cur-config-direnv) ; Direnv is the last to be loaded

(provide 'init)
#+end_src

* Configuration Modules (=cur-config=)
:PROPERTIES:
:ID:       9eb5052a-d247-44f4-95bf-0747de210827
:END:

The following are the modules that the =init.el= loads.

** Essential configuration (=cur-config-essentials.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-essentials.el
:ID:       56443852-8eb0-4c6d-9d51-fe8d48d6ab66
:END:

These are the basic configurations that I have done in Emacs. Its sort of a hodge-podge of fixing/changing things that are built Emacs. They aren't strictly essential so the name is kind of a misnomer.

*** =cur-config-essentials.el= section on parentheses highlighting
:PROPERTIES:
:ID:       861dafb4-2509-481d-8ca4-21be9174cdb1
:END:

=paren= is what highlights the matching parenthesis, bracket, brace, etc. of the one next to point. For some reason the default is to have delay in the highlight that is just long enough that it makes Emacs seem slow when it actually isn't.

#+begin_src emacs-lisp
;; ===Parens===
(use-package paren
  :ensure nil
  :demand t
  :custom
  (show-paren-delay 0 "No delay for paren highlighting"))
#+end_src

*** =cur-config-essentials.el= section on line numbers
:PROPERTIES:
:ID:       8869ca67-28b7-43bc-93e4-ea28dbf87807
:END:

I like having absolute line numbers, especially since the meow number selection makes relative line numbers not as useful. Some modes, especially terminal and shell modes, look weird with line numbers so I disable them. I also have them disabled in modes like =org-mode= which have non-textual elements (e.g. images) because they make the buffer look janky.

#+begin_src emacs-lisp
;; ===Line Numbers===
(use-package emacs
  :custom
  (display-line-numbers-type t)
  :config
  (column-number-mode 1)
  (global-display-line-numbers-mode 1)
  ;; Disable line numbers for terminal modes
  (dolist (mode '(bookmark-bmenu-mode-hook
                  org-mode-hook
                  dired-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  eat-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode -1)))))

#+end_src

*** =cur-config-essentials.el= section on bookmark settings
:PROPERTIES:
:ID:       e62f628a-9d35-4526-8a1e-4e30d17bece8
:END:

The built in bookmark feature of Emacs is great and one of the pillars of making Emacs a one-stop-shop for all* your computing needs. Really the only changes that I need to make is to set bookmarks to autosave and for  =hl-line-mode= to be enabled in =bookmark-bmenu-mode=.

#+begin_src emacs-lisp
;; ===Bookmarks===
(use-package bookmark
  :commands (bookmark-set
             bookmark-set-no-overwrite
             bookmark-jump
             bookmark-bmenu-list)
  :hook (bookmark-bmenu-mode . hl-line-mode)
  :config
  (setq bookmark-save-flag 1))
#+end_src

*** =cur-config-essentials.el= section on recent files
:PROPERTIES:
:ID:       afd9b978-9ce9-4a22-a6d5-05115ac660dc
:END:

This sets emacs to save the most recently visited files. I enable this primarily for quick file access.

#+begin_src emacs-lisp
(use-package recentf
  :hook (emacs-startup . recentf-mode))
#+end_src

