home/programs/emacs/emacs.org
*** =cur-config-essentials.el= section on ~isearch~ and incremental searching
:PROPERTIES:
:ID:       9f9b16a7-d53f-4ae5-84c7-d3eff7f604e4
:END:

=isearch=, or incremental search, is Emacs' primary incremental search (shocker). I mainly use it where my usual searching methods (see the section on =meow= and =consult=) aren't available or convenient like in =info= buffers. It is also very good for working with [[info:emacs#Keyboard Macros][keyboard macros]].

#+begin_src emacs-lisp
(use-package isearch
  :ensure nil
  :demand t
  :custom
  (isearch-wrap-pause 'no-ding)
  (isearch-repeat-on-direction-change t)
  :config
  (setq isearch-lazy-count t)
  (setq lazy-count-prefix-format "(%s/%s) ")
  (setq lazy-count-suffix-format nil))
#+end_src

*** =cur-config-essentials.el= section on ~occur~ and finding regexp occurrences
:PROPERTIES:
:ID:       be1322cb-70d6-4c7f-9a9d-ae2b4a552cc2
:END:

~occur~ is a command to find occurrences in a buffer that match a regexp and display those matches in a ~compile~ like buffer. This allows you to quickly see and edit patterns of text. It's useful but has the draw back of not being search-as-you-type.

#+begin_src emacs-lisp
(use-package emacs
  :custom (list-matching-lines-jump-to-current-line nil)
  :bind ( :map occur-mode-map
	  ("RET" . occur-mode-goto-occurrence-other-window)
	  :map search-map
	  ("o" . occur)))
#+end_src

*** =cur-config-essentials.el= section on ~grep~ and searching with grep in emacs
:PROPERTIES:
:ID:       f8a5f08e-cb9f-4e81-b124-09258d3d54f0
:END:

Emacs provides nice wrappers around standard cli commands such as grep. You can run grep with the aptly named ~grep~ command which will put all of the results in a ~compile~ like buffer. However, using grep this way isn't much more useful than using Emacs' built in ~occur~. What's more useful is grepping over multiple files which is what ~lgrep~ and ~rgrep~ are for. I also have emacs set to use ripgrep instead of grep if it is available.

#+begin_src emacs-lisp
(use-package grep
  :ensure nil
  :commands (grep lgrep rgrep)
  :custom
  (grep-save-buffers 'ask)
  :bind ( :map search-map
	  ("d" . lgrep)
	  ("r" . rgrep)
	  :map grep-mode-map
	  ("M-e" . compilation-next-file)
	  ("M-a" . compilation-previous-file))
  :config
  (let ((rg-found (executable-find "rg")))
    (setopt grep-template (if rg-found
			      "rg --no-heading -nH --null -e <R> <F>"
			      "grep <X> <C> -nH --null -e <R> <F>"))
    (setopt xref-search-program (if rg-found 'ripgrep 'grep))))
#+end_src

*** =cur-config-essentials.el= section on ~proced~ and viewing process (htop like)
:PROPERTIES:
:ID:       43057235-3fa9-4f74-a68f-805448523905
:END:

=proced= provides an htop like overview of what processes are running. Though I mainly use [[https://github.com/ClementTsang/bottom][bottom]] because of its pretty visuals, I do find it occasionally useful.

#+begin_src emacs-lisp
(use-package proced
  :ensure nil
  :if (eq system-type 'gnu/linux)
  :commands (proced)
  :custom
  (proced-auto-update-flag t)
  (proced-enable-color-flag t)
  (proced-auto-update-interval 2)
  (proced-descend t)
  (proced-filter 'user))
#+end_src

*** =cur-config-essentials.el= section on starting the Emacs server
:PROPERTIES:
:ID:       f526082c-4ebe-42b6-95b0-155e98dc7786
:END:

Its no secret that Emacs has a slow startup time when compared to other text editors like ([[https://neovim.io/][neo]])[[https://www.vim.org/][vim]]. This is an often cited reason to use X editor instead of Emacs. However, I practically never have to deal with slow startup times by using [[info:emacs#Emacs Server][Emacs' server functionality]]. This allows me to have to the best of both worlds: I can have a long lived Emacs session, only dealing with startup once and I can spawn and kill ad hoc Emacs Client frames for any need. I often spawn these ad hoc frames when working on school work or browsing media I have downloaded.

The typical way to start Emacs as a server is to run ~emacs --daemon~ or start it as a systemd service. However, I prefer to launch it as a part of my configuration 1 second after Emacs launches, but only if a sever is not already running. I do this so that Emacs sort of just "does what I mean" with out having to set up a service or make sure I use the appropriate flag.

#+begin_src emacs-lisp
(use-package server
  :defer 1
  :config
  (setq server-client-instructions nil)
  (unless (server-running-p)
    (server-start)))
#+end_src

*** =cur-config-essentials.el= section on ~tmr~ (tomato timer in emacs)
:PROPERTIES:
:ID:       57ae1e8f-83da-4f1a-96ad-770d88ffcdce
:END:

[[https://protesilaos.com/emacs/tmr][TMR]] is a simple tomato timer in Emacs with a convenient notation.

#+begin_src text :tangle ./packages.txt :padline no
tmr
#+end_src

#+begin_src emacs-lisp
(use-package tmr
  :defer t)
#+end_src

*** =cur-config-essentials.el= section on ~which-key~ and showing key bindings
:PROPERTIES:
:ID:       f98928ad-7a8d-47f1-be1f-c6fb33c35294
:END:

[[https://github.com/justbur/emacs-which-key][~which-key~]] shows you what keybindings are available in a keychord. Super helpful and +a must have in Emacs+ will be a part of Emacs 30 🎉.

#+begin_src text :tangle ./packages.txt :padline no
which-key
#+end_src

#+begin_src emacs-lisp
;; ===which-key===
(use-package which-key
  :demand t
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 1.0))
#+end_src

*** =cur-config-essentials.el= call to ~provide~
:PROPERTIES:
:ID:       2d610426-19cb-42e2-9a50-fee49ffca0ba
:END:

At the bottom of all Emacs Lisp libraries a all to ~provide~ with the name of the library is required. For example, if the file is named =foobar.el= the call to provide will be ~(provide 'foobar)~. At the end of each my configuration modules there will be a call to provide but I will not really document it as it is documented here.

#+begin_src emacs-lisp
(provide 'cur-config-essentials)
#+end_src

** Key bindings configurations (=cur-config-bindings.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-bindings.el
:ID:       c6c1b5c2-a355-42d3-9e0b-ec3521726fae
:END:

This module is the base of my key bindings. I use [[https:github.com/meow-edit/meow][meow]], a modal editing layer designed to be well integrated into the rest of the Emacs ecosystem. It's very easy to hack on and extend and just feels more Emacsy (e.g. using regular keymaps instead of =general.el=). I have had almost no issues with this, compared to evil which just felt sluggish and was hard to customize. The object-verb syntax is also really great and I prefer it to the verb-object of vim/nvim. There are also some other things I use in this section, such as ~repeat-mode~ and ~hydra~.

*** =cur-config-bindings.el= section on ~repeat-mode~ and repeating key bindings
:PROPERTIES:
:ID:       a78dad5e-2675-4530-a3ea-8066f102905c
:END:

~repeat-mode~ is one of the most basic ways to make working with standard Emacs key bindings a breeze. In its simplest form, it allows you to be able to simply repeat a key with out a prefix or modifiers. For example, instead of having to type =C-x o C-x o C-x o C-x o= to cycle through 4 windows, you would just keep hitting the =o= key, typing =C-x o o o o=. In more advanced cases you have several (often related) commands that are just a key-press away. This is one of those features that, in my opinion, should just be enabled by default in Emacs. This is [[info:emacs#Repeating][section in the manual]] talks about it some and this [[https://karthinks.com/software/it-bears-repeating/][blog post]] by [[https://karthinks.com/][karthinks]] goes very in depth into what ~repeat-mode~ can do.

#+begin_src emacs-lisp
;; ===Repeat Mode===
(use-package emacs
  :hook (after-init . repeat-mode))
#+end_src

*** =cur-config-bindings.el= section on ~hydra~ and quick transient key maps
:PROPERTIES:
:ID:       5ec45ba2-771f-461f-835c-b6e5a6bd350d
:END:

~hydra~ is a package that makes creating ad hoc [[info:transient#Top][transient]] key maps very easy. Transient key maps are temporary keyboard driven menus, somewhere between full on modal editing and keyboard short cuts. [[info:magit#Top][magit]] is a good example of what transient key maps are capable of.

#+begin_src text :tangle ./packages.txt :padline no
hydra
#+end_src

#+begin_src emacs-lisp
;; ===Hydra===
(use-package hydra
  :demand t)
#+end_src

*** =cur-config-bindings.el= section on ~avy~ and jumping to characters
:PROPERTIES:
:ID:       fc0629a4-40b3-45fd-880f-67c14d1aee36
:END:

~avy~ is a package that allows you to quickly jump to a point on screen. I almost exclusively use ~avy-goto-char-2~ as opposed to ~avy-goto-char-timer~ since I like consistent behavior in my editing commands. ~avy~ also has commands for being able to quickly edit or select text at a point as well but I honestly never use it as I prefer using ~meow~ editing commands. If that does interest you please read [[https://karthinks.com/software/avy-can-do-anything/][this article]] by [[https://karthinks.com/][karthinks]].

#+begin_src text :tangle ./packages.txt :padline no
avy
#+end_src

#+begin_src emacs-lisp
(use-package avy
  :bind ( :map goto-map
	  ("c" . avy-goto-char-2)))
#+end_src

