home/programs/emacs/emacs.org
*** =cur-config-bindings.el= section on ~meow-tree-sitter~
:PROPERTIES:
:ID:       9082076e-8399-470a-8778-83c9c800065d
:END:

This integrates ~meow~'s thing system with tree-sitter, allowing me to quickly select classes, functions, arguments, etc. This is not a complete system for structural editing but it is a good component.

#+begin_src text :tangle ./packages.txt :padline no
meow-tree-sitter
#+end_src

#+begin_src emacs-lisp
(use-package meow-tree-sitter
  :after meow
  :config
  (meow-tree-sitter-register-defaults))

#+end_src

*** =cur-config-bindings.el= call to ~provide~
:PROPERTIES:
:ID:       e866972a-7579-4005-938d-b068c9a6c660
:END:

#+begin_src emacs-lisp
(provide 'cur-config-bindings)
#+end_src

** Dired configuration (=cur-config-dired.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-dired.el
:ID:       fe71ad88-6ff2-4974-a849-f0e5ff9bc906
:END:

Dired is the built in file manager in Emacs. Its very capable and very hackable although it lacks good file previewing solutions

*** =cur-config-dired.el= section on ~nerd-icons-dired~ and file icons
:PROPERTIES:
:ID:       d413c669-dc46-41e6-a7b3-e3415d847e28
:END:

Adds icons to make dired a bit more pretty and gives a visual sense of what files are what. 

#+begin_src text :tangle ./packages.txt :padline no
nerd-icons-dired
#+end_src

#+begin_src emacs-lisp
;; ===Dired Icons===
(use-package nerd-icons-dired
  :after (dired)
  :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

*** =cur-config-dired.el= section on the main ~dired~ configuration
:PROPERTIES:
:ID:       18cf0d85-e484-4b03-98c1-cc016c928b17
:END:

By default, I want dired to look very minimal. This lack of clutter makes it easier to focus on what I am doing in the file manager. This is also the approach I try to take with other parts of Emacs as well. By default, I have file details (owner, permissions, last modified, etc.) hidden. I have other changes as well, use the system trash can instead of deleting, that are under the ~:config~ part of the ~use-package~ declaration.

The keybindings are a hybrid of my normal state and the default dired keybindings.

#+begin_src emacs-lisp
;; ===Dired===
(use-package dired
  :ensure nil
  :hook
  (dired-mode . dired-hide-details-mode) ; don't show file details by default
  (dired-mode . hl-line-mode) ; Highlight the line the cursor is on
  (dired-mode . (lambda (&rest _)
		  (setq-local truncate-lines t)))
  ;; TODO: create a dired-find-file-dwim for external programs
  :bind ( :map dired-mode-map
          ;; ===Top Row===
          ;; ("1" . )
          ("!" . dired-do-shell-command)
          ;; ("2" . )
          ;; ("@" . )
          ;; ("3" . )
          ;; ("#" . )
          ;; ("4" . )
          ;; ("$" . )
          ;; ("5" . )
          ;; ("%" . )
          ;; ("6" . )
          ;; ("^" . )
          ;; ("7" . )
          ("&" . dired-do-async-shell-command)
          ;; ("8" . )
          ;; ("*" . )
          ;; ("9" . )
          ;; ("(" . )
          ;; ("0" . )
          ;; (")" . )

          ;; ===2nd Row===
          ("TAB"  . dired-hide-subdir)
          ("<backtab>" . dired-hide-all)
          ("q" . quit-window)
          ;; ("Q" . )
          ("w" . dired-mark-subdir-files)
          ;; ("W" . ) ; Bound it custom wallpaper settings
          ("e" . dired-next-subdir)
          ;; ("E" . )
          ("r" . dired-do-rename)
          ("R" . dired-do-rename-regexp)
          ("t" . dired-toggle-marks)
          ("T" . dired-kill-tree)
          ("y" . dired-copy-filename-as-kill)
          ;; ("Y" . )
          ("u" . dired-unmark)
          ("U" . dired-unmark-all-marks)
          ("i" . dired-toggle-read-only)
          ("I" . image-dired)
          ("o" . dired-do-async-shell-command)
          ("O" . dired-do-chown)
          ("p" . dired-next-marked-file)
          ;; ("P" . )
          ("-" . negative-argument)
          ;; ("_" . )

          ;; ===3rd Row===
          ("<escape>" . keyboard-quit)
          ("a" . dired-find-alternate-file)
          ;; ("A" . dired-find-alternate-file)
          ("s" . dired-kill-subdir)
          ("S" . dired-kill-tree)
          ("d" . dired-do-kill-lines)
          ("D" . dired-do-delete)
          ("f" . dired-goto-file)
          ("F" . dired-goto-subdir)
          ("g" . revert-buffer)
          ;; ("G" . )
          ("h" . dired-up-directory)
          ;; ("H" . )
          ;; ("j" . ) ; already bound in meow-motion-mode
          ;; ("J" . )
          ;; ("k" . ) ; already bound in meow-motion-mode
          ;; ("K" . )
          ;; ("l" . ) ; bound in cur-dired declaration
          ("L" . dired-find-file-other-window)
          (";" . dired-toggle-marks)
          (":" . scroll-down-command)
          ("RET" . dired-find-file)
          ("S-RET" . dired-find-file-other-window)

          ;; ===4th Row===
          ("z" . dired-undo)
          ;; ("Z" . )
          ("x" . dired-mark)
          ("X" . dired-mark-files-regexp)
          ("c" . dired-do-copy)
          ("C" . dired-do-copy-regexp)
          ("v" . dired-view-file)
          ;; ("V" . )
          ("b" . dired-prev-subdir)
          ;; ("B" . )
          ("n" . dired-next-marked-file)
          ;; ("N" . )
          ;; ("m" . )
          ("M" . dired-do-chmod)
          ("," . dired-prev-dirline)
          ("<" . beginning-of-buffer)
          ("." . dired-next-dirline)
          (">" . end-of-buffer)
          ("/" . dired-sort-toggle-or-edit)
          ("?" . scroll-up-command)
          ;; ("'"  . ) ; Leave these blank, usually embark-act
          ;; ("\"" . ) ; Leave these blank, usually embark-dwim
          :map cur/sub-leader-keymap
          ("d" . dired))
  :custom
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'always)
  (delete-by-moving-to-trash t)
  (dired-dwim-target t)
  (dired-listing-switches "-A -G -F -h -l -v --group-directories-first --time-style=long-iso")
  (dired-guess-shell-alist-user '(("\\.\\(png\\|jpe?g\\|tiff\\|gif\\)" "xdg-open" "imv" "feh")
                                  ("\\.\\(mp[34]\\|m4a\\|ogg\\|flac\\|webm\\|mkv\\|mov\\)" "xdg-open" "mpv" "vlc")
                                  ("\\.pdf" "xdg-open" "zathura")
                                  (".*" "xdg-open")))
  (dired-auto-revert-buffer #'dired-directory-changed-p)
  (dired-free-space nil)
  (dired-make-directory-clickable t)
  (dired-mouse-drag-files t)
  :config
  (setq dired-deletion-confirmer 'y-or-n-p)
  (setopt dired-do-revert-buffer (lambda (dir) (not (file-remote-p dir)))))

(use-package cur-dired
  :after (dired)
  :bind ( :map dired-mode-map
	  ("l" . cur-dired-maybe-insert-subdir-or-find-file)))
#+end_src

*** =cur-config-dired.el= section on setting my wallpaper
:PROPERTIES:
:ID:       a9bbcca2-9303-4252-8926-b0520fb68b7a
:END:

#+begin_src emacs-lisp
(use-package cur-wallpaper
  :after (dired)
  :bind ( :map dired-mode-map
	  ("W" . cur-wallpaper-set-wallpaper-dired)))

(use-package cur-wallpaper
  :after (image-dired)
  :bind ( :map image-dired-thumbnail-mode-map
	  ("W" . cur-wallpaper-set-wallpaper)))
#+end_src

*** =cur-config-dired.el= call to ~provide~
:PROPERTIES:
:ID:       11189827-2b84-4388-b819-4cf71456230c
:END:

#+begin_src emacs-lisp
(provide 'cur-config-dired)
#+end_src

** Faces, themes, and eye candy configurations (=cur-config-faces.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-faces.el
:ID:       c81f0f60-e024-4cf2-944d-259a037dfa7e
:END:

I think that Emacs should have a lot of eye candy, especially since I spend so much time in it. These are my configurations for Emacs' faces, theming and ui settings essentially.

*** =cur-config-faces.el= section on setting the default font and ~fontaine~
:PROPERTIES:
:ID:       e47e4025-4113-407a-a0a7-f37c4f2b94c7
:END:

JetBrains Mono supremacy.

#+begin_src text :tangle ./packages.txt :padline no
fontaine
#+end_src

#+begin_src emacs-lisp
;; ===Default Font===

(use-package fontaine
  :demand t
  :bind ( :map cur/toggle-map
	  ("C-s" . fontaine-set-preset))
  :custom
  (fontaine-presets '((regular)
		      (extra-small
		       :default-height 100)
		      (small
		       :default-height 107)
		      (large
		       :default-height 140)
		      (t
		       :default-family "JetBrainsMono Nerd Font"
		       :default-weight regular
		       :default-height 110

		       :fixed-pitch-family nil
		       :fixed-pitch-weight nil
		       :fixed-pitch-height 1.0

		       :fixed-pitch-serif-family nil
		       :fixed-pitch-serif-weight nil
		       :fixed-pitch-serif-height 1.0

		       :mode-line-active-height 1.0
		       :mode-line-inactive-height 1.0)))
  :config
  (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))
  (fontaine-mode 1))
#+end_src

*** =cur-config-faces.el= section on setting the default opacity
:PROPERTIES:
:ID:       7ef99fe8-31fa-4dfe-bfa5-068a69938a2f
:END:

I have this transparency set to be the same as with my Alacritty config. This adds more consistency to my computing experience. It also just looks really cool.

#+begin_src emacs-lisp
;; ===Default Opacity===
(add-to-list 'default-frame-alist
             '(alpha-background . 85))

(use-package emacs
  :preface
  (defun cur/toggle-frame-opacity ()
    (interactive)
    (let ((current-alpha (frame-parameter nil 'alpha-background)))
      (cond ((eq current-alpha 100)
	     (set-frame-parameter nil 'alpha-background 85))
	    (t
	     (set-frame-parameter nil 'alpha-background 100)))))
  :bind ( :map cur/toggle-map
	  ("C-o" . cur/toggle-frame-opacity)))
#+end_src

