home/programs/emacs/emacs.org
*** =cur-config-completion.el= section on quick directory jumping with ~consult-dir~
:PROPERTIES:
:ID:       bf673606-06f4-48f5-ba60-32dbe1dfb18b
:END:
#+begin_src text :tangle ./packages.txt :padline no
consult-dir
#+end_src

#+begin_src emacs-lisp
(use-package consult-dir
  :bind ( :map global-map
	  ("C-x C-d" . consult-dir)
	  :map minibuffer-local-completion-map
	  ("C-x C-d" . consult-dir)
	  ("C-x C-j" . consult-dir-jump-file)))

(use-package consult-dir
  :after vertico
  :bind ( :map vertico-map
	  ("C-x C-d" . consult-dir)
	  ("C-x C-j" . consult-dir-jump-file)))

(use-package consult-dir
  :after meow
  :bind ( :map cur/sub-leader-keymap
	  ("C-d" . consult-dir)))
#+end_src

*** TODO =cur-config-completion.el= section on ~embark~ and mini-buffer actions
:PROPERTIES:
:ID:       89487c3d-ae1e-443c-9fbf-99e7042e33f5
:END:

#+begin_src text :tangle ./packages.txt :padline no
embark
embark-consult
#+end_src

#+begin_src emacs-lisp
(use-package emabark
  :bind ( :map global-map
          ("C-." . embark-act)
          :map minibuffer-local-map
          ("C-." . embark-act)
          :map dired-mode-map
          ("'"  . embark-act)
          ("\"" . embark-dwim)))
#+end_src

*** TODO =cur-config-completion.el= section on ~corfu~ and in-buffer completions
:PROPERTIES:
:ID:       9b2c6589-f87c-411a-b302-7424f24f24a8
:END:

#+begin_src text :tangle ./packages.txt :padline no
corfu
#+end_src

#+begin_src emacs-lisp
(use-package corfu
  :bind
  (:map corfu-map
	("TAB"       . corfu-next)
	("<tab>"     . corfu-next)
	("S-TAB"     . corfu-previous)
	("<backtab>" . corfu-previous)
	("<escape>"  . corfu-quit) ; note: cannot bind "ESC" because it causes errors
	("M-SPC"     . corfu-insert-separator))
  :custom
  (corfu-auto t)
  (corfu-preview-current 'insert)
  (corfu-auto-delay 0.1)
  (corfu-auto-prefix 3)
  (corfu-max-width 40)
  (corfu-popupinfo-delay '(2.0 . 1.0))
  (tab-always-indent 'complete)
  :hook
  (corfu-mode . corfu-popupinfo-mode))
#+end_src

*** TODO =cur-config-completion.el= section on ~cape~ and making completion at point functions (capfs)
:PROPERTIES:
:ID:       64087654-2ad5-4dba-8de8-91b572720ca2
:END:

#+begin_src text :tangle ./packages.txt :padline no
cape
#+end_src

*** =cur-config-completion.el= call to ~provide~
:PROPERTIES:
:ID:       ee9fb108-8f60-46d1-8b23-b3799f30716f
:END:

#+begin_src emacs-lisp
(provide 'cur-config-completion)
#+end_src

** Window management configurations (=cur-config-window.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-window.el
:ID:       a4ff1a2a-9b63-4fca-98d7-2a7d5433fa12
:END:

*** =cur-config-window.el= section on ~display-buffer-alist~ and default window behavior
:PROPERTIES:
:ID:       b363dfea-a062-4803-a381-66c9eb9674ff
:END:

These are my settings for ~display-buffer-alist~ so windows just Do What I Mean.

#+begin_src emacs-lisp
(use-package cur-window
  :config
  (setq window-sides-slots
        '(1 1 1 1))
  (setq display-buffer-alist
        '(("\\`\\*Async Shell Command.*\\'"
           (display-buffer-no-window))
          ("\\*Org Src.*"
           (display-buffer-same-window))
          ((or (derived-mode . compilation-mode)
               (derived-mode . geiser-mode)
               (derived-mode . grep-mode)
               (derived-mode . help-mode)
               (derived-mode . Info-mode)
               (derived-mode . rg-mode)
               (derived-mode . woman-mode))
           (cur-window-display-buffer-below-or-pop)
           (body-function . cur-window-select-fit-to-size))
	  ("\\*Embark Actions\\*"
           (display-buffer-reuse-mode-window display-buffer-below-selected)
           (window-height . fit-window-to-buffer))
	  ("\\*Register Preview\\*"
           (display-buffer-reuse-mode-window display-buffer-at-bottom)
           (window-height . fit-window-to-buffer)
	   (window-parameters . ((mode-line-format . none))))
          ((or (derived-mode . occur-mode)
               (derived-mode . xref--xref-buffer-mode))
           (display-buffer-reuse-window
            display-buffer-below-selected)
           (dedicated . t)
           (body-function . cur-window-select-fit-to-size))
          ((or (derived-mode . justl-mode)
               "justl - .*")
           (display-buffer-reuse-window
            display-buffer-at-bottom)
           (dedicated . t)
           (window-height . 0.25))
	  ((or "\\*eshell .*"
               "\\*.*-eshell*"
               "\\*.*-eat\\*")
           (display-buffer-reuse-window
            display-buffer-at-bottom)
           (window-height . 0.25))
          ((or (derived-mode . vterm-mode)
               "\\*vterm.*\\*"
               "\\*.*-vterm\\*")
           (display-buffer-reuse-mode-window
            display-buffer-same-window))
	  ((or (derived-mode . reb-mode)
	       (derived-mode . reb-lisp-mode)
	       "\\*RE-Builder\\*")
	   (display-buffer-reuse-mode-window
	    display-buffer-at-bottom)
	   (window-height . 0.25))
	  (".*"
	   (display-buffer-same-window)))))
#+end_src

*** =cur-config-window.el= section on ~ace-window~ and O(1) window switching/actions
:PROPERTIES:
:ID:       bbb30d94-91c8-49b8-ae87-22bb1f228e26
:END:

#+begin_src text :tangle ./packages.txt :padline no
ace-window
#+end_src

#+begin_src emacs-lisp
(use-package ace-window
  :custom
  (aw-keys '(?n ?h ?j ?k ?l ?i ?u ?y ?r ?e))
  (aw-dispatch-always t)
  :config
  (setq aw-dispatch-alist '((?d delete-window)
			    (?D aw-delete-window "Delete Window")
			    (?m aw-swap-window "Swap Window")
			    (?w aw-flip-window)
			    (?b cur-aw-switch-buffer-in-window "Select Buffer")
			    (?s aw-split-window-horz "Split Horizonally")
			    (?v aw-split-window-vert "Split Vertically")
			    (?o delete-other-windows)
			    (?O delete-other-windows "Delete Other Windows")
			    (?? aw-show-dispatch-help))))

(use-package cur-aw
  :after ace-window)
#+end_src

*** =cur-config-window.el= section on ~popper~ and pop windows
:PROPERTIES:
:ID:       79bfcbf0-8a10-4ef9-9d39-04e21e7fd1a9
:END:

#+begin_src text :tangle ./packages.txt :padline no
popper
#+end_src

#+begin_src emacs-lisp
(use-package popper
  :demand t
  :bind ( :map cur/toggle-map
	  ("w" . popper-toggle-type))
  :config
  (setopt popper-reference-buffers '("\\*eat\\*" "\\*.*-eat\\*$" eat-mode
				     "\\*eshell\\*" "\\*.*-eshell\\*$" eshell-mode
				     compilation-mode
				     occur-mode
				     geiser-mode
				     grep-mode
				     rg-mode
				     xref--xref-buffer-mode
				     reb-mode
				     reb-lisp-mode)))

(use-package popper-echo
  :after popper
  :hook (after-init . popper-echo-mode))

(use-package popper
  :after project
  :demand t
  :config
  (setopt popper-group-function #'popper-group-by-project))

(use-package popper
  :if (not (locate-library "cur-popper.el"))
  :config
  (setopt popper-display-function #'display-buffer-below-selected)
  (progn
    (popper-mode -1)
    (popper-mode +1)))

(use-package cur-popper
  :after (popper)
  :config
  (setopt popper-display-function #'cur-popper-display-buffer-dwim)
  (setopt popper-window-height #'cur-popper-fit-window-height)
  (setopt cur-popper-stay-conditions '())
  (progn
    (popper-mode -1)
    (popper-mode +1)))
#+end_src

*** =cur-config-window.el= section on paging up and down
:PROPERTIES:
:ID:       19429233-7dd7-4404-a925-90cd2267fa37
:END:

#+begin_src emacs-lisp
(use-package emacs
  :after repeat
  :preface
  (defvar cur/scroll-up-repeat-map
    (let ((map (make-sparse-keymap)))
      map)
    "The keymap to repeat scrolling up.")
  (defvar cur/scroll-down-repeat-map
    (let ((map (make-sparse-keymap)))
      map)
    "The keymap to repeat scrolling down.")
  :bind ( :repeat-map cur/scroll-down-repeat-map
	  ("v" . scroll-down-command)
	  :repeat-map cur/scroll-up-repeat-map
	  ("v" . scroll-up-command)))
#+end_src

*** =cur-config-window.el= call to ~provide~
:PROPERTIES:
:ID:       445fb6c0-bb89-463f-a8dc-b5185b1e3e97
:END:

#+begin_src emacs-lisp
(provide 'cur-config-window)
#+end_src

** IDE configurations (=cur-config-ide.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-ide.el
:ID:       20083d39-e9a2-4e1c-8fd0-c84993b8730c
:END:

Emacs can be made to have all the features of a modern text editor and then some.

*** =cur-config-ide.el= section on ~display-fill-column-indicator~
:PROPERTIES:
:ID:       4d229324-b82e-45e1-8886-3e9b1d702650
:END:

This is just a minor mode that shows a small bar at a certain column position. It's useful for a quick eyeball test if the line is too big but sometimes hurts readability.

#+begin_src emacs-lisp
(use-package emacs
  :custom
  (display-fill-column-indicator-column 81)
  ;; Enable this hook for it to show up in prog-mode
  ;; :hook (prog-mode . (lambda (&rest _)
  ;; 		       (display-fill-column-indicator-mode +1)))
  )
#+end_src

*** =cur-config-ide.el= section on ~lsp-mode~ and lsp
:PROPERTIES:
:ID:       b0b77539-5afd-4043-987e-557363d778bc
:END:

Lsp-mode is my chosen language server protocol support package. I chose this over eglot because of the richer features and (at the time that I started using lsp) more mature state. I will revisit elgot in the future but for now I am perfectly happy with lsp-mode.

#+begin_src text :tangle ./packages.txt :padline no
lsp-mode
#+end_src

#+begin_src emacs-lisp
;; ===LSP Mode===
(use-package lsp-mode
  :demand t
  :hook
  (lsp-mode  . lsp-enable-which-key-integration)
  :custom
  (lsp-keymap-prefix "C-c C-M-l" "lsp mode keymap")
  (lsp-file-watch-threshold 1750)
  (lsp-headerline-breadcrumb-enable nil)
  :bind (:map lsp-mode-map
              ("C-c C-a" . lsp-execute-code-action)  ; code actions
              ("C-c C-e" . lsp-treemacs-errors-list) ; treemacs error list
              ("C-c f"   . lsp-find-references)      ; find references
              ("C-c r"   . lsp-find-definition))     ; find definitions
  :config
  (lsp-deferred)
  (setq gc-cons-threshold (* 100 1024 1024))
  (setq read-process-output-max (* 3 1024 1024))
  (setq lsp-idle-delay 0.500)
  (setq lsp-lens-enable nil)
  (lsp-enable-which-key-integration t))
#+end_src

*** =cur-config-ide.el= section on ~lsp-ui~
:PROPERTIES:
:ID:       9b8b7653-7f3f-47f8-a5a1-e41c0fd07407
:END:

Lsp-ui provides some ui enhancements and extra features to lsp. Probably the best one is the doc feature to view documentation in the editor.

#+begin_src text :tangle ./packages.txt :padline no
lsp-ui
#+end_src

#+begin_src emacs-lisp
(use-package lsp-ui
  :after (lsp-mode)
  :custom
  (lsp-ui-doc-enable nil "lsp-ui doc disabled by default")
  (lsp-ui-doc-show-with-cursor t "lsp-ui doc follows cursor")
  (lsp-ui-doc-show-with-mouse t "lsp-ui doc follows mouse")
  (lsp-ui-doc-position 'at-point "lsp-ui doc shows at cursor")
  :bind (:map lsp-ui-mode-map
              ("C-c C-f" . lsp-ui-peek-find-references)  ; find references ui
              ("C-c C-r" . lsp-ui-peek-find-definitions) ; find definitions ui
              ("C-c C-d" . lsp-ui-doc-mode) ; toggle doc mode
              :map lsp-ui-peek-mode-map
              ("ESC" . lsp-ui-peek--abort)             ; toggle doc mode
              ("g"   . lsp-ui-peek--abort)             ; toggle doc mode
              ("j"   . lsp-ui-peek--select-next)       ; toggle doc mode
              ("k"   . lsp-ui-peek--select-prev)       ; toggle doc mode
              ("C-j" . lsp-ui-peek--select-next-file)  ; toggle doc mode
              ("C-k" . lsp-ui-peek--select-prev-file)) ; toggle doc mode
  :hook
  (lsp-mode . lsp-ui-mode))
#+end_src

*** TODO =cur-config-ide.el= section on ~eglot~ and lsp
:PROPERTIES:
:ID:       73015191-0919-4808-8b8b-377c9e3682f8
:END:

*** =cur-config-ide.el= section on ~company~ and auto-complete
:PROPERTIES:
:ID:       4ce88735-e016-41ec-890c-26fac1907c9a
:END:

The code completion system. This is different from completions systems like ivy or vertico, this is for interactively completing a symbol while programming.

#+begin_src text :tangle ./packages.txt :padline no
company
#+end_src

#+begin_src emacs-lisp
;; ===Company Mode===
(use-package company
  :hook
  (prog-mode . company-mode)
  (lsp-mode . company-mode)
  :bind ( :map company-active-map
          ("<tab>" . company-complete-common-or-cycle)
          ("<return>" . company-complete-selection)
	  :map company-mode-map
	  ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
;;(company-tng-configure-default))
#+end_src

*** =cur-config-ide.el= section on ~flycheck~ and in-buffer error messages
:PROPERTIES:
:ID:       5aa2456b-f94d-4151-83e2-f56995516dce
:END:

Code error checking with a nice UI.

#+begin_src text :tangle ./packages.txt :padline no
flycheck
#+end_src

#+begin_src emacs-lisp
;; ===Flycheck===
(use-package flycheck
  :hook
  (prog-mode . flycheck-mode)
  (lsp-mode  . flycheck-mode))
#+end_src

*** TODO =cur-config-ide.el= section on ~flymake~ and in-buffer error messages
:PROPERTIES:
:ID:       cfbd2b8f-7860-4c1f-b54c-c81664bd499a
:END:

