home/programs/emacs/emacs.org
*** =cur-config-ide.el= section on ~magit~ and quick git interface
:PROPERTIES:
:ID:       c4b9aa02-bb0d-429c-88c1-780057bdac94
:END:

Magit is a git interface, probably the best one I have ever seen or had the pleasure of using. I consider magit to be one of Emacs' "killer features", right up there with org-mode.

#+begin_src text :tangle ./packages.txt :padline no
magit
#+end_src

#+begin_src emacs-lisp
;; ===Magit===
(use-package magit
  :bind ( :map cur/sub-leader-keymap
          ("C-v" . magit)
          :map project-prefix-map
          ("C-v" . nil)
          ("v" . magit-project-status)
          ("V" . project-vc-dir))
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  (transient-default-level 5 "Allowing for commit signing"))
#+end_src

*** =cur-config-ide.el= section on ~project~ and project related functions
:PROPERTIES:
:ID:       ee41e6f2-1b63-4438-b3b0-bd8c6082a4ef
:END:

#+begin_src emacs-lisp
(use-package project
  :bind ( :map project-prefix-map
          ("d"   . project-dired)
          ("D"   . project-find-dir)
          ("C-b" . nil)
          ("b"   . project-switch-to-buffer)
          ("l"   . project-list-buffers))
  :custom
  (project-buffers-viewer #'project-list-buffers-ibuffer)
  (project-switch-use-entire-map t))
#+end_src

*** =cur-config-ide.el= section on using ~ripgrep~ in Emacs
:PROPERTIES:
:ID:       a8175c44-4cf2-4b2d-b7be-9eec48a2f1a5
:END:

Ripgrep go burrr.

#+begin_src text :tangle ./packages.txt :padline no
rg
#+end_src

#+begin_src emacs-lisp
(use-package rg)
#+end_src

*** =cur-config-ide.el= section on ~rainbow-delimiters~
:PROPERTIES:
:ID:       9586f275-5609-4e85-bfc8-4f3e621fb7d0
:END:

This color codes opening and closing delimiters such as parentheses and square brackets.

#+begin_src text :tangle ./packages.txt :padline no
rainbow-delimiters
#+end_src

#+begin_src emacs-lisp
;; ===rainbow-delimiters===
(use-package rainbow-delimiters
  ;; :ensure t
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** =cur-config-ide.el= section on ~paredit~
:PROPERTIES:
:ID:       a0bb932b-650d-45d1-b0d2-e8d673408d41
:END:

#+begin_src text :tangle ./packages.txt :padline no
paredit
#+end_src

#+begin_src emacs-lisp
;; ===Paredit===
(use-package paredit
  :hook ((emacs-lisp-mode lisp-interaction-mode scheme-mode) .
         (lambda () (paredit-mode 1))))
#+end_src

*** =cur-config-ide.el= section on ~geiser~ and working with schemes
:PROPERTIES:
:ID:       b44c76ac-9660-4cc5-80d6-81112a734185
:END:

#+begin_src text :tangle ./packages.txt :padline no
geiser
geiser-chez
geiser-chibi
geiser-chicken
geiser-gambit
geiser-gauche
geiser-guile
geiser-kawa
geiser-mit
geiser-racket
geiser-stklos
macrostep
macrostep-geiser
#+end_src

*** =cur-config-ide.el= section on java programming
:PROPERTIES:
:ID:       9f889f1e-d963-46ae-af5f-77fd0ba59779
:END:

My configurations for working with the Java language. I have ~java-ts-mode~, the tree sitter version of the normal ~java-mode~, as the mode for editing =.java= files. I have found that either tree sitter provides exactly the same or better syntax highlighting and the possibility of better movement once it gets better integrated into emacs.

I also have lsp-java set up for better integrating ~lsp-mode~ into ~java-ts-mode~. Note because I have =direnv= integration with ~envrc~, the hooks I add to start ~lsp~ must be ~lsp-defered~. ~lsp-defered~ does not start ~lsp-mode~ until after the buffer has visually loaded. We want this because ~envrc~ will change the ~exec-path~ to what =direnv= would change it to. For instance, if I have a devshell that says "here is the lsp-server, the build tool, and external libraries with these exact versions", envrc will make sure that ~exec-path~ contains exactly those versions of those programs in the nix store.

#+begin_src text :tangle ./packages.txt :padline no
lsp-java
#+end_src

#+begin_src emacs-lisp
;; ===Java Tree-Sitter Mode===
(use-package java-ts-mode
  :mode "\\.java\\'"
  :custom (java-ts-mode-indent-offset 8))

;; ===lsp-java===
(use-package lsp-java
  :after (lsp-mode cc-mode)
  :init
  :hook
  (envrc-mode . (lambda ()
                  (when (equal major-mode 'java-ts-mode)
                    (setq lsp-java-server-install-dir (concat (getenv "JDTLS_PATH") "/share/java/jdtls/")))))
  (java-ts-mode . lsp-deferred)
  :config
  (defun lsp-java--ls-command ()
    (let ((jdtls-path (getenv "JDTLS_PATH"))
          (jdtls-exec-options (list
                               "-configuration"
                               (concat (getenv "HOME") "/.jdtls/config_linux")
                               "-data"
                               (concat (getenv "HOME") "/.jdtls/java-workspace"))))
      (message (concat jdtls-path "/share/java/"))
      (append (list (concat jdtls-path "/bin/jdtls")) jdtls-exec-options))))
#+end_src

*** =cur-config-ide.el= section on working with justfiles
:PROPERTIES:
:ID:       8e3e0c17-47b3-4a83-a4f2-381ab03727ef
:END:

#+begin_src text :tangle ./packages.txt :padline no
just-mode
#+end_src

#+begin_src emacs-lisp
(use-package just-mode
  :defer t)
#+end_src

*** =cur-config-ide.el= section on yaml files
:PROPERTIES:
:ID:       40209140-b2b5-4a24-94b3-fa14ffa2c7d7
:END:
#+begin_src text :tangle ./packages.txt :padline no
yaml-mode
#+end_src

#+begin_src emacs-lisp
;; ===YAML===
(use-package yaml-mode
  :commands (yaml-mode))
#+end_src

*** =cur-config-ide.el= configurations for nix
:PROPERTIES:
:ID:       2736a16d-403e-4b3e-bc6a-6be6e3cdd679
:END:

My configurations for the Nix language, which boils down to "start the lsp server".

#+begin_src text :tangle ./packages.txt :padline no
nix-mode
nix-ts-mode
#+end_src

#+begin_src emacs-lisp
;; ===nix-mode===
(use-package nix-mode
  :hook
  (nix-mode . lsp-deferred)) ;; So that envrc mode will work

(use-package nix-mode
  :after lsp-mode
  :custom
  (lsp-disabled-clients '((nix-mode . nix-nil)) "disable nil so that nixd will be used as lsp-server")
  (lsp-nix-nixd-server-path "nixd" "set nixd binary path to be use from current $PATH"))
#+end_src

*** =cur-config-ide.el= configurations for rust
:PROPERTIES:
:ID:       5faeccc8-de89-47ac-bd25-43fe3df10b9a
:END:

#+begin_src text :tangle ./packages.txt :padline no
rustic
#+end_src

#+begin_src emacs-lisp
;; ===Rust-Mode===
(use-package rustic
  :after (lsp-mode)
  :hook (rustic . lsp-deferred))
#+end_src

*** =cur-config-ide.el= configurations for haskell
:PROPERTIES:
:ID:       36eb4cf2-82a0-4de6-a27c-d56413744789
:END:

#+begin_src text :tangle ./packages.txt :padline no
haskell-mode
company-ghci
#+end_src

#+begin_src emacs-lisp
;; ===Haskell-Mode===
(use-package haskell-mode)

;; ===LSP-Haskell===
(use-package lsp-haskell
  :hook
  ((haskell-mode) . lsp-deferred))

;; ===Company-GHCI===
(use-package company-ghci
  :after (company)
  :custom (company-ghc-show-info t)
  :config
  (push 'company-ghci company-backends))
#+end_src

*** =cur-config-ide.el= configurations for ocaml
:PROPERTIES:
:ID:       b17c9828-12cb-4ccf-b7a8-6dd60f1bfe29
:END:

#+begin_src text :tangle ./packages.txt :padline no
tuareg
utop
merlin
merlin-company
#+end_src

#+begin_src emacs-lisp
;; ===Tuareg===
(use-package tuareg
  :hook (tuareg-mode . merlin-mode)
  :defer t)

;; ===Utop===
(use-package utop
  :commands (utop utop-mode)
  :config
  (advice-add 'utop :around 'inheritenv-apply))

(use-package merlin
  :defer t)

(use-package merlin-company
  :after (merlin))
#+end_src

*** =cur-config-ide.el= configurations for C lang
:PROPERTIES:
:ID:       45a60406-d36b-4649-a0b3-0bd4a2135470
:END:

I use tree-sitter for C, which unfortunately is not currently integrated into the default C major mode for Emacs. I have also changed the ~c-default-style~ for C to be "linux", which is 8 spaces for indentation instead of the default of 2.

#+begin_src text :tangle ./packages.txt :padline no
ccls
#+end_src

#+begin_src emacs-lisp
;; ===C Tree-Sitter Mode===
(use-package c-ts-mode
  :after (cc-mode)
  :mode
  ("\\.c\\'" . c-ts-mode)
  ("\\.h\\'" . c-ts-mode)
  :custom
  (c-default-style '((c-ts-mode . "linux")
                     (java-mode . "java")
                     (awk-mode  . "awk")
                     (other     . "gnu"))
		   "default style for c programs is linux")
  :hook
  (c-ts-mode . (lambda () (require 'ccls) (lsp-deferred))))

;; ===CCLS Mode===
(use-package ccls
  :after (cc-mode c-ts-mode))
#+end_src

*** =cur-config-ide.el= configurations for zig
:PROPERTIES:
:ID:       cd00a97f-9707-4b53-9700-fe0342382691
:END:

#+begin_src text :tangle ./packages.txt :padline no
zig-mode
#+end_src

#+begin_src emacs-lisp
;; ===Zig Mode===
(use-package zig-mode
  :hook (zig-mode . lsp-deferred))
#+end_src

*** =cur-config-ide.el= configurations for go
:PROPERTIES:
:ID:       378f48d2-ab20-4851-8837-69e6793830f0
:END:

#+begin_src emacs-lisp
;; ===Go Tree-Sitter Mode===
(use-package go-ts-mode
  :mode
  ("\\.go\\'" . go-ts-mode)
  ("go\\.mod\\'" . go-mod-ts-mode)
  :custom
  (go-ts-mode-indent-offset 4 "Set the indentation to 4")
  :hook
  (go-ts-mode . lsp-deferred)
  (go-ts-mode . (lambda () (setq tab-width 4))))
#+end_src

*** =cur-config-ide.el= call to ~provide~
:PROPERTIES:
:ID:       94476685-e2fc-4e23-999d-66c68818fecd
:END:

#+begin_src emacs-lisp
(provide 'cur-config-ide)
#+end_src

** Terminal emulation and Eshell configuration (=cur-config-shell.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-shell.el
:ID:       c6096b33-de53-4f61-b021-add1e4449984
:END:

*** =cur-config-shell.el= section on ~vterm~ and fast, accurate terminal emulation
:PROPERTIES:
:ID:       de664b6d-e7b6-4ef2-b418-b1e91baef0a9
:END:

Vterm is a terminal emulator for Emacs. It is faster than ~term~ and ~ansi-term~ but the downside is that it is not written entirely in elisp so its cross platform. ~cur/meow-vterm~ and ~cur/meow-vterm-other-window~ help make vterm more "intuitive". ~cur/vterm-kill~ kills the vterm buffer cleanly and without prompting.

#+begin_src text :tangle ./packages.txt :padline no
vterm
#+end_src

#+begin_src emacs-lisp
;; ===Vterm===
(use-package vterm
  :bind ( :map cur/sub-leader-keymap
          ("C-S-t" . vterm))
  :custom
  (vterm-shell "fish")
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
  (setq vterm-max-scrollback 10000))

(use-package cur-vterm
  :bind ( :map vterm-mode-map
          ("C-c C-RET"      . cur-vterm-enter-password)
          ("C-c C-<return>" . cur-vterm-enter-password)
          :map project-prefix-map
          ("T" . cur-vterm-project-other-window)))
#+end_src

