home/programs/emacs/emacs.org
*** =cur-config-shell.el= section on ~eat~ and terminal emulation
:PROPERTIES:
:ID:       522c5038-171d-4163-9bce-7b36e5cbded8
:END:

Eat is just a better elisp terminal emulator. I mostly use this so that eshell can run TUI programs.

#+begin_src text :tangle ./packages.txt :padline no
eat
#+end_src

#+begin_src emacs-lisp
;; ===Eat===
(use-package eat
  :hook (eat-exec . (lambda (&rest _) (eat-line-mode)))
  :bind ( :map eat-mode-map
	  ("C-c C-RET" . eat-send-password)
	  ("C-c C-<return>" . eat-send-password)
	  :map project-prefix-map
	  ("t" . eat-project)
	  :map cur/sub-leader-keymap
	  ("C-t" . eat))
  :custom
  (eat-kill-buffer-on-exit t)
  (eat-enable-directory-tracking t))

(use-package eat
  :after meow
  :hook
  (eat--char-mode . (lambda (&rest _)
		      (if eat--char-mode
			  (meow-mode -1)
			(unless meow-mode
			  (meow-mode +1))))))

(use-package eat
  :after eshell
  :hook (eat-eshell-exec . (lambda (&rest _) (eat-eshell-emacs-mode)))
  :bind ( :map eat-eshell-emacs-mode-map
	  ("C-c C-RET" . eat-send-password)
	  ("C-c C-<return>" . eat-send-password)
	  :map eat-eshell-semi-char-mode-map
	  ("C-c C-RET" . eat-send-password)
	  ("C-c C-<return>" . eat-send-password))
  :custom
  (eshell-visual-commands nil "nil because using `eat-eshell-mode'")
  (eshell-visual-subcommands nil "nil because using `eat-eshell-mode'")
  :config
  (eat-eshell-mode 1))

(use-package eat
  :if (locate-library "corfu.el")
  :hook (eat-mode . (lambda (&rest _)
		      (setq-local corfu-auto nil)
		      (setq-local corfu-quit-at-boundary nil)
		      (corfu-mode +1))))
#+end_src

*** =cur-config-shell.el= section on ~eshell~, the Emacs Shell
:PROPERTIES:
:ID:       6f582490-9acf-4e04-8253-ec2a3bc2ed24
:END:

Eshell is an shell for Emacs like bash or sh, but written in elisp and has its own ways of doing things. Note: not POSIX compliant.

#+begin_src text :tangle ./packages.txt :padline no
eshell-syntax-highlighting
#+end_src

#+begin_src emacs-lisp
;; ===Eshell===
(use-package eshell
  :bind ( :map cur/sub-leader-keymap
          ("C-e" . eshell)))

(use-package eshell
  :if (locate-library "corfu.el")
  :hook
  (eshell-mode . (lambda (&rest _)
		   (setq-local corfu-auto nil)
		   (setq-local corfu-quit-at-boundary nil)
		   (corfu-mode +1))))

(use-package eshell-syntax-highlighting
  :after eshell
  :config
  (eshell-syntax-highlighting-global-mode +1))

(use-package cur-eshell
  :after (eshell)
  :custom
  (eshell-prompt-function 'cur-eshell-prompt "Set custom prompt for eshell")
  :config
  (setopt eshell-prompt-regexp cur-eshell-prompt-regexp))
#+end_src

*** =cur-config-shell.el= call to ~provide~
:PROPERTIES:
:ID:       8ddb6cc7-67d2-414d-a5cc-ffdcb3ea2d9c
:END:

#+begin_src emacs-lisp
(provide 'cur-config-shell)
#+end_src

** Org-mode (=cur-config-org.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-org.el
:ID:       280d85c5-9e50-4048-9e1a-269c8b711ff5
:END:

#+begin_src text :tangle ./packages.txt :padline no
org-bullets
#+end_src

#+begin_src emacs-lisp
;; ===Org-Mode===
(use-package org
  :ensure nil
  :defer t
  :hook (org-mode . cur/org-mode-setup)
  :bind ( :map org-mode-map
          ("C-S-h" . outline-promote)
          ("C-S-j" . outline-move-subtree-down)
          ("C-S-k" . outline-move-subtree-up)
          ("C-S-l" . outline-demote))
  :init
  (defun cur/org-mode-setup ()
    (org-indent-mode 1)
    (variable-pitch-mode 0)
    (visual-line-mode 1)
    (flyspell-mode 1))
  :custom
  (org-ellipsis " ▾" "Readable ellipsis")
  (org-adapt-indentation nil)
  (org-special-ctrl-a/e nil)
  (org-M-RET-may-split-line '((default . nil)))
  (org-hide-emphasis-markers nil)
  (org-hide-macro-markers nil)
  (org-hide-leading-stars nil)
  (org-agenda-start-with-log-mode t)
  (org-src-window-setup 'plain) ; don't override `display-buffer-alist'
  (org-log-done 'time)
  (org-log-into-drawer t)
  (org-agenda-window-setup 'current-window "Have org-agenda pop up in the current window")
  (org-imenu-depth 4)
  (org-edit-src-content-indentation 0)
  :config
  (load-library "find-lisp")
  ;; (setq org-agenda-files (find-lisp-find-files "~/dox/agenda" "\.org$"))
  (setq org-agenda-time-grid '((daily today require-timed)
                               (400 600 800 1000 1200 1400 1600 1800 2000 2200)
                               "......" "----------------"))
  (setq org-format-latex-options '(:foreground "#e5e9e9" :scale 1.0)))
;; (cur/org-font-setup))
#+end_src

#+begin_src emacs-lisp
;; ===Org Tempo and SRC Blocks===
(use-package org-tempo
  :after org
  :custom
  (org-structure-template-alist
   '(("s" . "src")
     ("e" . "src emacs-lisp")
     ("t" . "src emacs-lisp :tangle FILENAME")
     ("T" . "src text :tangle FILENAME")
     ("P" . "src text :tangle ./packages.txt :padline no")
     ("x" . "export")
     ("X" . "example")
     ("q" . "quote")
     ("v" . "verse"))))
#+end_src

#+begin_src emacs-lisp
;; ===Org Babel===
(use-package ob
  :after org)
;; TODO: fix this so I can still auto tangle on saving
;; :init
;; (defun cur/org-babel-tangle-config ()
;;   (when (string-equal (file-name-directory (buffer-file-name))
;;                       (expand-file-name user-emacs-directory))
;;     ;; Dynamic scoping to the rescue
;;     (let ((org-confirm-babel-evaluate nil))
;;       (org-babel-tangle))))
;; 
;; (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'cur/org-babel-tangle-config))))
#+end_src

#+begin_src emacs-lisp
(use-package flyspell
  :bind ( :map flyspell-mode-map
          ("C-." . nil)
          ("C-," . nil)))

(provide 'cur-config-org)
#+end_src

** Configurations for working with the Internet (=cur-config-net.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-net.el
:ID:       0dfed815-701f-4f77-8ec3-ab921c88a7ca
:END:

*** =cur-config-net.el= section on gemini and the smolnet
:PROPERTIES:
:ID:       03175fe0-f192-4307-b2c2-24669236c508
:END:

#+begin_src text :tangle ./packages.txt :padline no
gemini-mode
ox-gemini
elpher
#+end_src

#+begin_src emacs-lisp
;; ===Gemini-Mode===
(use-package gemini-mode
  :defer t)

;; ===Org Gemini Exporter==
(use-package ox-gemini
  :after org
  :commands (org-gemini-export-to-file org-gemini-export-to-buffer))

;; ===Elpher Gemini/Gopher Client===
(use-package elpher
  :defer t
  :custom
  (elpher-default-url-type "gemini"))
#+end_src

*** =cur-config-net.el= section on ~elfeed~, and rss/atom feed reader
:PROPERTIES:
:ID:       08dfceb3-1c1c-482e-a3fb-c94151a7d1b9
:END:

#+begin_src text :tangle ./packages.txt :padline no
elfeed
#+end_src

#+begin_src emacs-lisp
;;; cur-config-elfeed.el --- Links for elfeed -*- lexical-binding: t -*-

(use-package elfeed
  :defer t
  :bind ( :map elfeed-show-mode-map
	  ("w" . elfeed-show-visit)
	  ("e" . eww)
	  :map elfeed-search-mode-map
	  ("w" . elfeed-search-browse-url)
	  ("e" . eww))
  :config
  (setopt elfeed-search-filter "@2-weeks-ago")
  (setopt elfeed-db-directory (concat (abbreviate-file-name (expand-file-name user-emacs-directory)) "elfeed-db")))

(let ((cur-links-path (locate-user-emacs-file "cur-elfeed-links")))
  (use-package elfeed
    :if (file-readable-p cur-links-path)
    :config
    (setopt elfeed-feeds (car (read-from-string (with-temp-buffer
						  (insert-file-contents cur-links-path)
						  (buffer-substring-no-properties (point-min) (point-max))))))))
#+end_src

*** =cur-config-net.el= section on ~elfeed~ integration with youtube and ~yt-dlp~
:PROPERTIES:
:ID:       6f6b6415-898e-4e38-9a0f-c314470e382a
:END:

#+begin_src text :tangle ./packages.txt :padline no
elfeed-tube
elfeed-tube-mpv
#+end_src

#+begin_src emacs-lisp
(use-package elfeed-tube
  :after elfeed
  :demand t
  :bind ( :map elfeed-show-mode-map
	  ("F" . elfeed-tube-fetch)
	  ([remap save-buffer] . elfeed-tube-save)
	  :map elfeed-search-mode-map
	  ("F" . elfeed-tube-fetch)
	  ([remap save-buffer] . elfeed-tube-save))
  :config
  (setopt elfeed-tube-auto-fetch-p t
	  elfeed-tube-auto-save-p nil)
  (elfeed-tube-setup))

(use-package elfeed-tube-mpv
  :after (elfeed-tube elfeed)
  :demand t
  :bind ( :map elfeed-show-mode-map
	  ("v"       . elfeed-tube-mpv)
	  ("C-c C-f" . elfeed-tube-mpv-follow-mode)
	  ("C-c C-w" . elfeed-tube-mpv-where)
	  :map elfeed-search-mode-map
	  ("v" . elfeed-tube-mpv)))

(provide 'cur-config-elfeed)
#+end_src

*** =cur-config-net.el= section on playing youtube videos
:PROPERTIES:
:ID:       3ec2df0a-91ea-4e95-b3e3-fc950c5153c6
:END:

#+begin_src emacs-lisp
(use-package cur-yt
  :commands (cur-yt-play-video))

(use-package cur-yt
  :after (elfeed elfeed-tube)
  :bind ( :map elfeed-show-mode-map
	  ("V" . cur-yt-play-video)
	  :map elfeed-search-mode-map
	  ("V" . cur-yt-play-video)))
#+end_src

*** =cur-config-net.el= section on ~elcord~ and making myself look productive to my friends
:PROPERTIES:
:ID:       7184df32-7e9e-4a3a-8621-8a89077c34d6
:END:

#+begin_src text :tangle ./packages.txt :padline no
elcord
#+end_src

#+begin_src emacs-lisp
(use-package elcord
  :custom
  (elcord-boring-buffers-regexp-list '("^ " "\\\\*Messages\\\\*"
				       "\\\\*Help\\\\*" "\\\\*elpher\\\\*"
				       "\\\\*Org Src .*\\\\*"
				       "\\\\*Occur\\\\*"
				       "\\\\*Embark Collect .*\\\\*")))
#+end_src

*** =cur-config-net.el= call to ~provide~
:PROPERTIES:
:ID:       6a681b64-ee9c-4c07-85be-b8c60a83164b
:END:

#+begin_src emacs-lisp
(provide 'cur-config-net)
#+end_src

** Direnv integration (=cur-config-direnv.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-direnv.el
:ID:       95bc6815-90f6-4630-83b0-fd87e98204b4
:END:

#+begin_src text :tangle ./packages.txt :padline no
envrc
inheritenv
#+end_src

#+begin_src emacs-lisp
;; ===Envrc===
(use-package envrc
  :config
  (envrc-global-mode))

(provide 'cur-config-direnv)
#+end_src

* Custom Library Modules (=cur-lisp=)
:PROPERTIES:
:ID:       154b7ee9-1ad9-4e58-93e5-07dff545776f
:END:

** Ace Window Extensions (=cur-aw.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-aw.el
:ID:       03e2b639-de95-4cd4-bc24-89745ad8908a
:END:

#+begin_src emacs-lisp
;;; cur-aw.el --- The extensions for ace-window -*- lexical-binding: t -*-

;;; Commentary:

;;; Code:

(require 'ace-window)

(defgroup cur-aw ()
  "Base functions and variables for my Emacs configuration."
  :group 'windows)

(defun cur-aw--switch-buffer ()
  "Call `consult-buffer' if it is bound.
Call `switch-to-buffer' if it is not."
  (cond ((fboundp 'consult-buffer)
	 (call-interactively 'consult-buffer))
	(t
	 (call-interactively 'switch-to-buffer))))

(defun cur-aw-switch-buffer-in-window (window)
  "Switch to buffer in WINDOW.
Prefer the use of `consult-buffer'."
  (aw-switch-to-window window)
  (cur-aw--switch-buffer))

(provide 'cur-aw)
;;; cur-aw.el ends here
#+end_src

** Base Values and Functions (=cur-base.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-base.el
:ID:       39558113-15a3-49d8-a8b8-6821a24685fe
:END:

#+begin_src emacs-lisp
;;; cur-base.el --- The base of my customizations for emacs -*- lexical-binding: t -*-

;;; Commentary:
;; This is the base of my extensions to Emac's functionality.
;; Do try this at home kids.

;;; Code:

(defgroup cur-base ()
  "Base functions and variables for my Emacs configuration."
  :group 'editing)

(provide 'cur-base)
;;; cur-base.el ends here
#+end_src

