home/programs/emacs/emacs.org
** Dired Extensions (=cur-dired.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-dired.el
:ID:       4bb3fd54-986d-43e7-b408-2ed2fb272ac5
:END:

#+begin_src emacs-lisp
;;; cur-dired.el --- My extensions to dired -*- lexical-binding: t -*-

;;; Commentary:

;;; Code:

;;;###autoload
(defun cur-dired-maybe-insert-subdir-or-find-file (&optional other-window)
  (interactive "P")
  (let ((file (dired-get-file-for-visit)))
    (if (file-directory-p file)
	(if other-window
	    (dired-other-window file)
	  (dired-maybe-insert-subdir file nil t))
      (if other-window
	  (find-file-other-window file)
	(dired--find-possibly-alternative-file file)))))

;;;###autoload
(defun cur-dired-find-file-dwim (&optional other-window)
  (interactive "P")
  (let* ((file (dired-get-file-for-visit)))
    (if (file-directory-p file)
	(or (when other-window
	      (progn
		(dired-other-window file)	
		(dired-goto-file file)))
	    (when (and (cdr dired-subdir-alist)
		       (dired-goto-subdir file))
	      (when dired-trivial-filenames
		(dired-goto-next-nontrivial-file))
	      (run-hooks 'dired-initial-position-hook)
	      t)
	    (dired--find-possibly-alternative-file file))
      (progn
	(if other-window
	    (dired-find-file-other-window file)
	  (dired--find-possibly-alternative-file file))))))

(provide 'cur-dired)
;;; cur-dired.el ends here

#+end_src

** Eshell aliases and extensions (=cur-eshell.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-eshell.el
:ID:       f776fb00-2e8b-4936-9e75-62ca15f268cb
:END:

#+begin_src emacs-lisp
;;; cur-eshell.el --- My exensions of the Emacs Shell -*- lexical-binding: t -*-

;;; Commentary:

;;; Code:

(require 'eshell)
(require 'em-dirs)
(require 'em-unix)
(require 'files)
(require 'dired)

(defun cur-eshell-prompt ()
  "A minimal and colourful prompt for `eshell'.
Set `eshell-prompt-function' to this function to enable."
  (let* ((red     (face-foreground 'ansi-color-red))
         (green   (face-foreground 'ansi-color-green))
         (yellow  (face-foreground 'ansi-color-yellow))
         (blue    (face-foreground 'ansi-color-blue))
         (magenta (face-foreground 'ansi-color-magenta))
         ;; (cyan    (face-foreground 'ansi-color-cyan))
         (white   (face-foreground 'ansi-color-white)))
    (concat
     (propertize "["                   'face `(:weight bold :foreground ,red))
     (propertize (eshell/whoami)       'face `(:weight bold :foreground ,yellow))
     (propertize "@"                   'face `(:weight bold :foreground ,green))
     (propertize (system-name)         'face `(:weight bold :foreground ,blue))
     " "
     (propertize (concat (abbreviate-file-name (eshell/pwd))) 'face `(:weight bold :foreground ,magenta))
     (propertize "]"                   'face `(:weight bold :foreground ,red))
     (propertize "λ "                  'face `(:weight bold :foreground ,white)))))

(defun eshell/i (fn)
  "Call FN interactively.
FN should be a string."
  (let ((user-fn (intern-soft fn)))
    (cond ((and user-fn (commandp user-fn))
	   (call-interactively user-fn))
	  (user-fn
	   (user-error "Function is not an interactive function"))
	  (t
	   (user-error "There was no function with that name")))))

(defun eshell/ff (&optional file)
  "Eshell alias to open FILE.
Will call `find-file' interactively if no file is specified."
  (cond (file
         (find-file file))
        (t
         (call-interactively 'find-file))))

(defun eshell/lf (&optional dir)
  "Eshell alias to open `dired' at DIR.
Will call `dired' on current directory if no directory is specified."
  (cond (dir
         (dired dir))
        (t
         (dired "."))))

(defun eshell/icd (&optional _)
  "Interactively change directories with `read-file-name'.
This function ignores its argument."
  (let* ((default-dir (read-file-name "Switch To: " nil nil t nil #'file-directory-p)))
    (unless (string-empty-p default-dir)
      (eshell/cd default-dir))))

(defvar cur-eshell-prompt-regexp
  "^\\[.*?@.*? [/~].*\\]?[#$λ] "
  "Regex for the `cur-eshell-prompt' prompt.")

(provide 'cur-eshell)
;;; cur-base.el ends here
#+end_src

** Meow Extension (=cur-meow.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-meow.el
:ID:       4aa1f51c-204e-4479-8295-d0522d178789
:END:

#+begin_src emacs-lisp
;;; cur-meow.el --- Extending Meow's Capabilities -*- lexical-binding: t -*-

;;; Commentary:
;;

;;; Code:
(require 'meow)

(defun cur-meow-toggle-temp-normal-motion ()
  "Toggle normal and motion mode.
If in neither of the two states, return nil."
  (interactive)
  (cond ((meow-normal-mode-p) (call-interactively 'meow-motion-mode))
        ((meow-motion-mode-p) (call-interactively 'meow-normal-mode))
        (t nil)))

(provide 'cur-meow)
;;; cur-meow.el ends here
#+end_src

** Popper Extensions (=cur-popper.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-popper.el
:ID:       3ad0cb08-93dd-43db-9522-fa21cf32b4c6
:END:

#+begin_src emacs-lisp
;;; cur-popper.el --- Extending Popper's capabilities -*- lexical-binding: t -*-

;;; Commentary:
;;

;;; Code:
(require 'popper)

(defgroup cur-popper ()
  "Base functions and variables for my Emacs configuration."
  :group 'popper)

(defcustom cur-popper-stay-conditions '()
  "A list of `buffer-match-p' conditions that determine if a popped buffer is focused."
  :type '(repeat (choice (cons (choice (const derived-mode) (const major-mode)) symbol)
			 string))
  :group 'cur-popper)

(defcustom cur-popper-select-window 'dwim
  "Whether to select a popped buffer with `cur-popper-dispaly-buffer-dwim'."
  :type '(choice (const :tag "Always" t)
		 (const :tag "Sometimes" dwim)
		 (const :tag "Never" nil))
  :group 'cur-popper)

(defun cur-popper-display-buffer-dwim (buffer &optional alist)
  "Display BUFFER at the bottom of the frame and conditonally select the window.
ALIST is passed to `dispaly-buffer-at-bottom'."
  (let* ((nalist (append alist `((window-height . ,popper-window-height))))
	 (window (display-buffer-at-bottom buffer nalist)))
    (pcase cur-popper-select-window
      (`nil window)
      (`dwim (if (not (buffer-match-p `(or . ,cur-popper-stay-conditions) (window-buffer window)))
		 (select-window window)
	       window))
      (_ (select-window window)))))

(defun cur-popper-fit-window-height (win)
  (fit-window-to-buffer
   win
   (floor (frame-height) 3)
   (floor (frame-height) 5)))

(provide 'cur-popper)
;;; cur-popper.el ends here
#+end_src

