home/programs/emacs/emacs.org
** Wallpaper Functions (=cur-wallpaper.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-wallpaper.el
:ID:       9b1350bf-332a-4f8a-a4cb-821486adf8e4
:END:

#+begin_src emacs-lisp
;;; cur-wallpaper.el --- Setting wallpaper through dired -*- lexical-binding: t -*-

;;; Commentary:

;;; Code:

(require 'dired)
(require 'image-dired)

(defun cur-wallpaper-set-wallpaper (arg)
  "Set wallpaper as ARG."
  (interactive (list (image-dired-original-file-name)))
  (call-process-shell-command
   (concat "swww img -t any " arg " &")))

(defun cur-wallpaper-set-wallpaper-dired (arg)
  "Set wallpaper as ARG."
  (interactive (list (dired-get-filename)))
  (call-process-shell-command
   (concat "swww img -t any " arg " &")))

(provide 'cur-wallpaper)
;;; cur-wallpaper.el ends here
#+end_src

** Window Management (=cur-window.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-window.el
:ID:       f7a52192-5fe8-45e6-a541-1139216007bd
:END:

#+begin_src emacs-lisp
;;; cur-window.el --- Customization and helper functions for window management -*- lexical-binding: t -*-

;;; Commentary:
;; Custom functions and variables for managing windows.  In particular, setting `display-buffer-alist'
;; so that windows are just placed how I want.
;;
;; Much of this was shamelessly stolen from Protesilaos Stavrou, who greatly inspired much of my config.
;; Please see https://protesilaos.com/emacs/dotemacs#h:35b8a0a5-c447-4301-a404-bc274596238d for his window
;; management section of his Emacs config.

;;; Code:

(defun cur-window--window-small-p ()
  "Return non-nil if window is small.
Check if the `window-width' or `window-height' is less than
`split-width-threshold' and `split-height-threshold',
respectively."
  (or (and (numberp split-width-threshold)
           (< (window-total-width) split-width-threshold))
      (and (numberp split-height-threshold)
           (> (window-total-height) split-height-threshold))))

(defun cur-window--three-or-more-windows-p (&optional frame)
  "Return non-nil if three or more windows occupy FRAME.
If FRAME is non-nil, inspect the current frame."
  (>= (length (window-list frame :no-minibuffer)) 3))

(defun cur-window--get-display-buffer-below-or-pop ()
  "Return list of functions for `cur-window-display-buffer-below-or-pop'."
  (list
   #'display-buffer-reuse-mode-window
   (if (or (cur-window--window-small-p)
           (cur-window--three-or-more-windows-p))
       #'display-buffer-below-selected
     #'display-buffer-pop-up-window)))

(defun cur-window-display-buffer-below-or-pop (&rest args)
  "Display buffer below current window or pop a new window.
The criterion for choosing to display the buffer below the
current one is a non-nil return value for
`prot-common-window-small-p'.

Apply ARGS expected by the underlying `display-buffer' functions.

This as the action function in a `display-buffer-alist' entry."
  (let ((functions (cur-window--get-display-buffer-below-or-pop)))
    (catch 'success
      (dolist (fn functions)
        (when (apply fn args)
          (throw 'success fn))))))

(defvar cur-window-window-sizes
  '( :max-height (lambda () (floor (frame-height) 3))
     :min-height 10
     :max-width (lambda () (floor (frame-width) 3))
     :min-width 20)
  "This is a property list of max and min values for window sizes.
This value is used by `cur-window-select-fit-to-size' to set the
size of the window.")

(defun cur-window--get-window-size (key)
  "Use KEY to extract the value from `cur-window-window-sizes'.
If the value is a number return it, if it is a function, call
it and return it's value."
  (when-let ((value (plist-get cur-window-window-sizes key)))
    (cond
     ((functionp value)
      (funcall value))
     ((numberp value)
      value)
     (t
      (error "The value of %s is not a number or function" key)))))

(defun cur-window-select-fit-to-size (window)
  "Select WINDOW and fit it to the buffer.
The minimum and maximum height and width is determined by
`cur-window-window-sizes'."
  (select-window window)
  (fit-window-to-buffer
   window
   (cur-window--get-window-size :max-height)
   (cur-window--get-window-size :min-height)
   (cur-window--get-window-size :max-width)
   (cur-window--get-window-size :min-width)))

(defvar cur-window-same-window-modes-list
  '(justl-mode)
  "List of major modes that should have their window reused.
The function `cur-window-display-buffer-below-or-pop' uses this variable to
determine if it will create a new window or reuse the current one.")

(defun cur-window--get-display-buffer-same-window-or-below ()
  "Return a list of functions for `cur-window-display-buffer-same-window-or-below'."
  (list
   #'display-buffer-reuse-window
   (if (memq major-mode cur-window-same-window-modes-list)
       #'display-buffer-same-window
     #'display-buffer-below-selected)))

(defun cur-window-display-buffer-same-window-or-below (&rest args)
  "Display buffer either reusing the current window or bellow."
  (let ((functions (cur-window--get-display-buffer-same-window-or-below)))
    (catch 'success
      (dolist (fn functions)
        (when (apply fn args)
          (throw 'success fn))))))

(provide 'cur-window)
;;; cur-window.el ends here
#+end_src

** Vterm extension (=cur-vterm.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-vterm.el
:ID:       7c12cb33-ff1d-4aff-a0af-aa6d0023efe0
:END:

#+begin_src emacs-lisp
;;; cur-vterm.el --- Customization and helper functions for vterm

;;; Commentary:

;;; Code:

(require 'vterm)

(defun cur-vterm-enter-password ()
  (declare (interactive-only t))
  (interactive)
  (unless (equal major-mode 'vterm-mode)
    (user-error "Not in a VTerm Terminal"))
  (vterm-insert (read-passwd "Password: "))
  (vterm-send-return))

(defun cur-vterm-project (&optional other-window)
  (interactive)
  (if-let* ((current-project (project-current))
            (default-directory (project-root current-project))
            (buffer-name (format "*%s-%s*" (project-name current-project) "vterm")))
      (if (buffer-live-p (get-buffer buffer-name))
          (if other-window
              (switch-to-buffer-other-window buffer-name)
            (switch-to-buffer buffer-name))
        (if other-window
            (vterm-other-window buffer-name)
          (vterm buffer-name)))
    (user-error "Cannot create vterm buffer in %s" (cdr current-project))))

(defun cur-vterm-project-other-window ()
  (interactive)
  (cur-vterm-project t))

(provide 'cur-vterm)
;;; cur-vterm.el ends here
#+end_src

** Playing YouTube Videos
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-yt.el
:ID:       2cd99819-9dc4-40d5-87ba-fdb2a878d8d2
:END:

#+begin_src emacs-lisp
;;; cur-yt.el --- a front end for playing YouTube videos with mpv -*- lexical-binding: t -*-

;;; Commentary:

;;; Code:

(require 'rx)

(defgroup cur-yt ()
  "UI for working with YouTube videos in Emacs."
  :group 'external)

;;; Helper Functions

(defvar cur-yt--youtube-view-key-regexp
  (rx bol
      (*? not-newline)
      "watch?v="
      (group-n 1 (= 11 anything))
      (*? not-newline)
      eol)
  "Regexp used to get view key from a YouTube URL.")

(defun cur-yt--get-view-key (url)
  "Get view key from URL."
  (save-match-data
    (string-match cur-yt--youtube-view-key-regexp url)
    (match-string-no-properties 1 url)))

(defun cur-yt--convert-to-yt-link (url)
  "Convert URL to a YouTube link."
  (let ((key (cur-yt--get-view-key url)))
    (when key
	(format "https://www.youtube.com/watch?v=%s" key))))

(defun cur-yt--mpv-ytdl-format (height)
  "Return the `mpv' option to get the best video of HEIGHT."
  (pcase height
      ("best" "--ytdl-format=bestvideo+bestaudio/best")
      ("worst" "--ytdl-format=worstvideo+worstaudio/worst")
      ((guard (string-match-p (rx (+ (any "0-9"))) height))
       (format "--ytdl-format=bestvideo[height<=?%s]+bestaudio/best" height))
      (_ (error "Cannot format option for mpv, '%s' is not a number" height))))

;;; Play Video

(defcustom cur-yt-play-default-resolution "1080"
  "The default video resolution for `cur-yt-play-video'.
If this video resolution is not available the next best resolution will be
downloaded instead.  It should be one of the common resolution heights YouTube
uses, \"best\" or \"worst\"."
  :type '(choice (const "best")
		 (const "2160")
		 (const "1440")
		 (const "1080")
		 (const "720")
		 (const "480")
		 (const "360")
		 (const "240")
		 (const "144")
		 (const "worst"))
  :group 'cur-yt)

(defvar cur-yt-play-url-history nil
  "Previous YouTube URLs played with `cur-yt-play-video'.")

(defun cur-yt--play-check-exetutables ()
  "Check if `mpv' and `yt-dlp'/`youtube-dl' are installed.
This function with error if it finds a missing program."
  (unless (executable-find "mpv")
    (error "`mpv' is not installed on the system, please install it"))
  (unless (or (executable-find "yt-dlp")
	      (executable-find "youtube-dl"))
    (error "Neither `yt-dlp' nor `youtube-dl' are installed, please install one of them"))
  t)

(defcustom cur-yt-play-always-prompt-resolution nil
  "Whether or not `cur-yt-play-video' should always prompt for resolution."
  :type '(boolean)
  :group 'cur-yt)

;;;###autoload
(defun cur-yt-play-video (url &optional resolution)
  "Play video URL at RESOLUTION."
  (interactive
   (list (read-string "YouTube URL: " nil
		      cur-yt-play-url-history
		      (when kill-ring
			(cur-yt--convert-to-yt-link (substring-no-properties (car kill-ring)))))
	 (when (or cur-yt-play-always-prompt-resolution current-prefix-arg)
	   (completing-read "Resolution: "
			    '("worst" "144" "240" "360" "480" "720" "1080" "1440" "2160" "best")
			    nil 'confirm nil t))))
  (cur-yt--play-check-exetutables)
  (let ((res (or resolution cur-yt-play-default-resolution))
	(yt-url (cur-yt--convert-to-yt-link url)))
    (unless yt-url
      (user-error "URL did not contain a YouTube view key"))
    (start-process "my-process" (get-buffer-create "sugma")
		   "mpv" (cur-yt--mpv-ytdl-format res) yt-url)
    (message "Playing %s at %s" yt-url (pcase res
					 ((or "best" "worst") (concat res " resolution"))
					 (_ (concat res "p"))))))

(provide 'cur-yt)
;;; cur-yt.el ends here
#+end_src

* Themes
:PROPERTIES:
:ID:       8a389991-b8c2-478c-b691-a5edace0a55c
:END:

